<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on mayo, 2 2007 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 24. Arrays</title>

<meta name="description" content="Manual de Maxima: 24. Arrays">
<meta name="keywords" content="Manual de Maxima: 24. Arrays">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,180); /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    font-family: "Lucida Console", monospace
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}
-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Arrays"></a>
<a name="SEC79"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_23.html#SEC78" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC80" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_23.html#SEC74" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC81" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 24. Arrays </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC80">24.1 Definiciones para Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Definiciones-para-Arrays"></a>
<a name="SEC80"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC79" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC81" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC79" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC79" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC81" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 24.1 Definiciones para Arrays </h2>

<dl>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> (<var>nombre</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX723"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> (<var>nombre</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX724"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> ([<var>nombre_1</var>, ..., <var>nombre_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX725"></a>
</dt>
<dd><p>Crea un array de dimensi&oacute;n <em>n</em>, que debe ser menor o igual que 5. Los sub&iacute;ndices de la <em>i</em>-&eacute;sima dimensi&oacute;n son enteros que toman valores entre 0 y <var>dim_i</var>.  
</p>
<p>La llamada <code>array (<var>nombre</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> crea un array de tipo general.
</p>
<p>La llamada <code>array (<var>nombre</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> crea un array con sus elementos del tipo especificado. El tipo <var>type</var> puede ser <code>fixnum</code> para enteros de tama&ntilde;o limitado o <code>flonum</code> para n&uacute;meros decimales en coma flotante.
</p>
<p>La llamada <code>array ([<var>nombre_1</var>, ..., <var>nombre_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</code>
crea <em>m</em> arrays,  todos ellos de igual dimensi&oacute;n.
</p>
<p>Si el usuario asigna un valor a una variable subindicada antes de declarar el array correspondiente, entonces se construye un array no declarado. Los arrays no declarados, tambi&eacute;n conocidos por el nombre de &quot;arrays de claves&quot; (hashed arrays), son m&aacute;s generales que los arrays declarados. El usuario no necesita declarar su tama&ntilde;o m&aacute;ximo y pueden ir creciendo de forma din&aacute;mica. Los sub&iacute;ndices de los arrays no declarados no necesitan ser necesariamente n&uacute;meros. Sin embargo, a menos que un array tenga sus elementos dispersos, probablemente sea m&aacute;s eficiente declararlo siempre que sea posible antes que dejarlo como no declarado. La funci&oacute;n <code>array</code> puede utilizarse para transformar un array no declarado a a uno declarado.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arrayapply</b><i> (<var>A</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX726"></a>
</dt>
<dd><p>Eval&uacute;a <code><var>A</var> [<var>i_1</var>, ..., <var>i_n</var>]</code>, donde <var>A</var> es un array y <var>i_1</var>, ..., <var>i_n</var> son enteros.
</p>
<p>Esto es como <code>apply</code>, excepto por el hecho de que el primer argumento es un array en lugar de una funci&oacute;n.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arrayinfo</b><i> (<var>A</var>)</i>
<a name="IDX727"></a>
</dt>
<dd><p>Devuelve informaci&oacute;n sobre el array<var>A</var>.
El argumento <var>A</var> puede ser un array declarado o no declarado,
una funci&oacute;n array o una funci&oacute;n subindicada.
</p>
<p>En el caso de arrays declarados, <code>arrayinfo</code> devuelve una
lista que contiene el &aacute;tomo <code>declared</code>, el n&uacute;mero de
dimensiones y el tama&ntilde;o de cada dimensi&oacute;n.
Los elementos del array, tanto los que tienen valores
asignados como los que no, son devueltos por <code>listarray</code>.
</p>
<p>En el caso de arrays no declarados (<i>hashed arrays</i>), <code>arrayinfo</code>
devuelve una lista que contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero
de sub&iacute;ndices y los sub&iacute;ndices de aquellos
elementos que guarden un valor. Los valores son devueltos por <code>listarray</code>.
</p>
<p>En el caso de funciones array, <code>arrayinfo</code> devuelve una lista que 
contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero de sub&iacute;ndices
y los sub&iacute;ndices para los que la funci&oacute;n tiene valores almacenados.
Los valores almacenados de la funci&oacute;n array son devueltos por <code>listarray</code>.
</p>
<p>En el caso de funciones subindicadas, <code>arrayinfo</code> devuelve una lista que
contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero de sub&iacute;ndices y
los sub&iacute;ndices para los que hay expresiones lambda.
Las expresiones lambda son devueltas por <code>listarray</code>.
</p>
<p>Ejemplos:
</p>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una array declarado.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) arrayinfo (aa);
(%o4)                 [declared, 2, [2, 3]]
(%i5) listarray (aa);
(%o5) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre></td></tr></table>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una array no declarado (<i>hashed arrays</i>).
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) arrayinfo (bb);
(%o3)               [hashed, 1, [BAR], [FOO]]
(%i4) listarray (bb);
                              3         2
(%o4)                 [(c - d) , (b + a) ]
</pre></td></tr></table>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una funci&oacute;n array.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) arrayinfo (cc);
(%o4)              [hashed, 2, [4, z], [u, v]]
(%i5) listarray (cc);
                              z  v
(%o5)                        [-, -]
                              4  u
</pre></td></tr></table>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una funci&oacute;n subindicada.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) arrayinfo (dd);
(%o4)             [hashed, 1, [b + a], [v - u]]
(%i5) listarray (dd);
                         b + a                v - u
(%o5)      [lambda([y], y     ), lambda([y], y     )]
</pre></td></tr></table>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arraymake</b><i> (<var>name</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX728"></a>
</dt>
<dd><p>El resultado es una referencia a array no evaluada.
</p>
<p>Devuelve la expresi&oacute;n <code><var>name</var> [<var>i_1</var>, ..., <var>i_n</var>]</code>.
</p>
<p>Esta funci&oacute;n es similar a <code>funmake</code>, excepto que el valor retornado es referencia a un array no evaluado, en lugar de una llamada a una funci&oacute;n no evaluada.
</p>
<p>Ejemplos:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) arraymake (A, [1]);
(%o1)                          A
                                1
(%i2) arraymake (A, [k]);
(%o2)                          A
                                k
(%i3) arraymake (A, [i, j, 3]);
(%o3)                       A
                             i, j, 3
(%i4) array (A, fixnum, 10);
(%o4)                           A
(%i5) fillarray (A, makelist (i^2, i, 1, 11));
(%o5)                           A
(%i6) arraymake (A, [5]); 
(%o6)                          A
                                5
(%i7) ''%;
(%o7)                          36
(%i8) L : [a, b, c, d, e];
(%o8)                    [a, b, c, d, e]
(%i9) arraymake ('L, [n]);
(%o9)                          L
                                n
(%i10) ''%, n = 3;
(%o10)                          c
(%i11) A2 : make_array (fixnum, 10);
(%o11)          {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i12) fillarray (A2, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o12)          {Array:  #(1 2 3 4 5 6 7 8 9 10)}
(%i13) arraymake ('A2, [8]);
(%o13)                         A2
                                 8
(%i14) ''%;
(%o14)                          9
</pre></td></tr></table>
</dd></dl>

<dl>
<dt><u>Variable del sistema:</u> <b>arrays</b>
<a name="IDX729"></a>
</dt>
<dd><p>Valor por defecto: <code>[]</code>
La variable <code>arrays</code> es una lista con todos los arrays que han sido alojados,
lo que comprende a los arrays declarados por <code>array</code>, a los
no declarados (<i>hashed arrays</i>) construidos impl&iacute;citamente
(asignando algo al elemento de un array) y a las funciones array definidas
mediante <code>:=</code> y <code>define</code>.
Los arrays definidos mediante <code>make_array</code> no se incluyen en
este grupo.
</p>
<p>V&eacute;anse tambi&eacute;n
<code>array</code>, <code>arrayapply</code>, <code>arrayinfo</code>, <code>arraymake</code>, 
<code>fillarray</code>, <code>listarray</code> y <code>rearray</code>.
</p>
<p>Ejemplos:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) array (aa, 5, 7);
(%o1)                          aa
(%i2) bb [FOO] : (a + b)^2;
                                   2
(%o2)                       (b + a)
(%i3) cc [x] := x/100;
                                   x
(%o3)                      cc  := ---
                             x    100
(%i4) dd : make_array ('any, 7);
(%o4)       {Array:  #(NIL NIL NIL NIL NIL NIL NIL)}
(%i5) arrays;
(%o5)                     [aa, bb, cc]
</pre></td></tr></table>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>bashindices</b><i> (<var>expr</var>)</i>
<a name="IDX730"></a>
</dt>
<dd><p>Transforma la expresi&oacute;n <var>expr</var> d&aacute;ndole a cada suma y producto un &uacute;nico &iacute;ndice. Esto le da a <code>changevar</code> mayor precisi&oacute;n cuando opera con sumas y productos. La forma del &uacute;nico &iacute;ndice es <code>j<var>number</var></code>. La cantidad <var>number</var> se determina en funci&oacute;n de <code>gensumnum</code>, valor que puede cambiar el usuario.  Por ejemplo, haciendo <code>gensumnum:0$</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>fillarray</b><i> (<var>A</var>, <var>B</var>)</i>
<a name="IDX731"></a>
</dt>
<dd><p>Rellena el array <var>A</var> con los valores de <var>B</var>, que puede ser una lista o array.
</p>
<p>Si se ha declarado <var>A</var> de un determinado tipo en el momento de su
creaci&oacute;n, s&oacute;lo podr&aacute; contener elementos de ese tipo, produci&eacute;ndose
un error en caso de intentar asignarle un elemento de tipo distinto.
</p>
<p>Si las dimensiones de los arrays <var>A</var> y <var>B</var> son diferentes,
<var>A</var> se rellena seg&uacute;n el orden de las filas. Si no hay 
suficientes elementos en <var>B</var> el &uacute;ltimo elemento se utiliza 
para cubrir el resto de <var>A</var>. Si hay demasiados, los elementos 
sobrantes son ignorados.
</p>
<p>La funci&oacute;n <code>fillarray</code> devuelve su primer argumento.
</p>
<p>Ejemplos:
</p>
<p>Creaci&oacute;n de un array de 9 elementos y posterior relleno a partir de una lista.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) array (a1, fixnum, 8);
(%o1)                          a1
(%i2) listarray (a1);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
(%i3) fillarray (a1, [1, 2, 3, 4, 5, 6, 7, 8, 9]);
(%o3)                          a1
(%i4) listarray (a1);
(%o4)              [1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre></td></tr></table>
<p>Si no hay suficientes elementos para cubrir el array, se repite el
&uacute;ltimo elemento. Si hay demasiados, los elementos 
sobrantes son ignorados.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) a2 : make_array (fixnum, 8);
(%o1)             {Array:  #(0 0 0 0 0 0 0 0)}
(%i2) fillarray (a2, [1, 2, 3, 4, 5]);
(%o2)             {Array:  #(1 2 3 4 5 5 5 5)}
(%i3) fillarray (a2, [4]);
(%o3)             {Array:  #(4 4 4 4 4 4 4 4)}
(%i4) fillarray (a2, makelist (i, i, 1, 100));
(%o4)             {Array:  #(1 2 3 4 5 6 7 8)}
</pre></td></tr></table>
<p>Arrays multidimensionales se rellenan seg&uacute;n el orden de las filas.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) a3 : make_array (fixnum, 2, 5);
(%o1)        {Array:  #2A((0 0 0 0 0) (0 0 0 0 0))}
(%i2) fillarray (a3, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o2)        {Array:  #2A((1 2 3 4 5) (6 7 8 9 10))}
(%i3) a4 : make_array (fixnum, 5, 2);
(%o3)     {Array:  #2A((0 0) (0 0) (0 0) (0 0) (0 0))}
(%i4) fillarray (a4, a3);
(%o4)     {Array:  #2A((1 2) (3 4) (5 6) (7 8) (9 10))}
</pre></td></tr></table>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>listarray</b><i> (<var>A</var>)</i>
<a name="IDX732"></a>
</dt>
<dd><p>Devuelve una lista con los elementos del array <var>A</var>.
El argumento <var>A</var> puede ser un array declarado o no declarado,
una funci&oacute;n array o una funci&oacute;n subindicada.
</p>
<p>Los elementos se ordenan en primera instancia respecto del primer 
&iacute;ndice, despu&eacute;s respecto del segundo &iacute;ndice
y as&iacute; sucesivamente.
La ordenaci&oacute;n de los &iacute;ndices es la misma que la 
establecida por <code>orderless</code>.
</p>
<p>En el caso de arrays no declarados, funciones array y funciones
subindicadas, los elementos corresponden a los &iacute;ndices
devueltos por <code>arrayinfo</code>.
</p>
<p>Los elementos de los arrays declarados que no tienen valores asignados
(excepto <code>fixnum</code> y <code>flonum</code>) se devuelven como <code>#####</code>.
Los elementos sin valores asignados de los arrays <code>fixnum</code> y <code>flonum</code>
son devueltos como 0 y 0.0, respectivamente.
Los elementos sin valor asignado de los arrays no declarados, 
funciones array y funciones subindicadas no son devueltos.
</p>
<p>Ejemplos:
</p>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a un array declarado.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) listarray (aa);
(%o4) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
(%i5) arrayinfo (aa);
(%o5)                 [declared, 2, [2, 3]]
</pre></td></tr></table>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a un array no declarado (<i>hashed array</i>).
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) listarray (bb);
                              3         2
(%o3)                 [(c - d) , (b + a) ]
(%i4) arrayinfo (bb);
(%o4)               [hashed, 1, [BAR], [FOO]]
</pre></td></tr></table>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a una funci&oacute;n array.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) listarray (cc);
                              z  v
(%o4)                        [-, -]
                              4  u
(%i5) arrayinfo (cc);
(%o5)              [hashed, 2, [4, z], [u, v]]
</pre></td></tr></table>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a una funci&oacute;n subindicada.
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) listarray (dd);
                         b + a                v - u
(%o4)      [lambda([y], y     ), lambda([y], y     )]
(%i5) arrayinfo (dd);
(%o5)             [hashed, 1, [b + a], [v - u]]
</pre></td></tr></table>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>make_array</b><i> (<var>tipo</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX733"></a>
</dt>
<dd><p>Construye y devuelve un array de Lisp. El argumento <var>tipo</var> puede ser
<code>any</code>, <code>flonum</code>, <code>fixnum</code>, <code>hashed</code> o <code>functional</code>.
Hay <em>n</em> &iacute;ndices, y el &iacute;ndice <em>i</em>-&eacute;simo
va de  0 a <em><var>dim_i</var> - 1</em>.
</p>
<p>La ventaja de <code>make_array</code> sobre <code>array</code> estriba en que el valor
retornado no tiene nombre, y una vez que un puntero deja de referenciarlo,
el valor desaparece. Por ejemplo, si <code>y: make_array (...)</code> entonces
<code>y</code> apunta a un objeto que ocupa cierto espacio en la memoria, pero
despu&eacute;s de <code>y: false</code>, <code>y</code> ya no apunta al objeto, por lo
que &eacute;ste puede ser considerado basura y posteriormente eliminado.  
</p>
<p>Ejemplos:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) A1 : make_array (fixnum, 10);
(%o1)           {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i2) A1 [8] : 1729;
(%o2)                         1729
(%i3) A1;
(%o3)          {Array:  #(0 0 0 0 0 0 0 0 1729 0)}
(%i4) A2 : make_array (flonum, 10);
(%o4) {Array:  #(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i5) A2 [2] : 2.718281828;
(%o5)                      2.718281828
(%i6) A2;
(%o6) 
     {Array:  #(0.0 0.0 2.718281828 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i7) A3 : make_array (any, 10);
(%o7) {Array:  #(NIL NIL NIL NIL NIL NIL NIL NIL NIL NIL)}
(%i8) A3 [4] : x - y - z;
(%o8)                      - z - y + x
(%i9) A3;
(%o9) {Array:  #(NIL NIL NIL NIL ((MPLUS SIMP) $X ((MTIMES SIMP)\
 -1 $Y) ((MTIMES SIMP) -1 $Z))
  NIL NIL NIL NIL NIL)}
(%i10) A4 : make_array (fixnum, 2, 3, 5);
(%o10) {Array:  #3A(((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0)) ((0 0 \
0 0 0) (0 0 0 0 0) (0 0 0 0 0)))}
(%i11) fillarray (A4, makelist (i, i, 1, 2*3*5));
(%o11) {Array:  #3A(((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15))
    ((16 17 18 19 20) (21 22 23 24 25) (26 27 28 29 30)))}
(%i12) A4 [0, 2, 1];
(%o12)                         12
</pre></td></tr></table>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>rearray</b><i> (<var>A</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX734"></a>
</dt>
<dd><p>Cambia las dimensiones de un array. El nuevo array ser&aacute; rellenado con los elementos del viejo seg&uacute;n el orden de las filas. Si el array antiguo era demasiado peque&ntilde;o, los elementos restantes se rellenan con <code>false</code>, <code>0.0</code> o <code>0</code>, dependiendo del tipo del array. El tipo del array no se puede cambiar.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>remarray</b><i> (<var>A_1</var>, ..., <var>A_n</var>)</i>
<a name="IDX735"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remarray</b><i> (all)</i>
<a name="IDX736"></a>
</dt>
<dd><p>Borra los arrays y las funciones relacionadas con ellos, liberando el espacio de memoria ocupado.
Los argumentos pueden ser arrays declarados, arrays no declarados (<i>hashed arrays</i>), 
funciones array y funciones subindicadas.
</p>
<p>La llamada <code>remarray (all)</code> borra todos los elementos de la lista global <code>arrays</code>.
</p>
<p>La funci&oacute;n <code>remarray</code> devuelve la lista de los arrays borrados.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>subvar</b><i> (<var>x</var>, <var>i</var>)</i>
<a name="IDX737"></a>
</dt>
<dd><p>Eval&uacute;a la expresi&oacute;n subindicada <code><var>x</var>[<var>i</var>]</code>.
</p>
<p>La funci&oacute;n <code>subvar</code> eval&uacute;a sus argumentos.
</p>
<p>La instrucci&oacute;n <code>arraymake (<var>x</var>, [<var>i</var>]</code> construye la expresi&oacute;n <code><var>x</var>[<var>i</var>]</code>,
pero no la eval&uacute;a.
</p>
<p>Ejemplos:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) x : foo $

(%i2) i : 3 $

(%i3) subvar (x, i);
(%o3)                         foo
                                 3
(%i4) foo : [aa, bb, cc, dd, ee]$

(%i5) subvar (x, i);
(%o5)                          cc
(%i6) arraymake (x, [i]);
(%o6)                         foo
                                 3
(%i7) ''%;
(%o7)                          cc
</pre></td></tr></table>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>use_fast_arrays</b>
<a name="IDX738"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>use_fast_arrays</code> vale <code>true</code> entonces tan solo se reconocen dos tipos de arrays. 
</p>
 
</dd></dl>

<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC79" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC81" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>mayo, 2 2007</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
