<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on mayo, 2 2007 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 47. draw</title>

<meta name="description" content="Manual de Maxima: 47. draw">
<meta name="keywords" content="Manual de Maxima: 47. draw">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,180); /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    font-family: "Lucida Console", monospace
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}
-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="draw"></a>
<a name="SEC180"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_46.html#SEC179" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC181" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC176" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC183" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 47. draw </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC181">47.1 Introducci&oacute;n a draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC182">47.2 Definiciones para draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>





<hr size="6">
<a name="Introducci_00f3n-a-draw"></a>
<a name="SEC181"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC180" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC180" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC180" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC183" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 47.1 Introducci&oacute;n a draw </h2>


<p><code>draw</code> es un interfaz para comunicar Maxima con Gnuplot.
</p>
<p>Hay tres funciones a utilizar a nivel de Maxima: 
<code>draw2d</code>, <code>draw3d</code> y <code>draw</code>.
</p>
<p>S&iacute;gase este enlace para ver ejemplos m&aacute;s elaborados
de este paquete:
</p>
<p>http://www.telefonica.net/web2/biomates/maxima/gpdraw
</p>
<p>Se necesita tener instalado Gnuplot 4.2 para ejecutar este paquete.
</p>




<hr size="6">
<a name="Definiciones-para-draw"></a>
<a name="SEC182"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC181" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC183" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC180" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC180" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC183" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 47.2 Definiciones para draw </h2>




<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xrange</b>
<a name="IDX1693"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>xrange</code> vale <code>false</code>, el rango de la coordenada <var>x</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>x</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>xrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [-3,5],
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>yrange</code> y <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yrange</b>
<a name="IDX1694"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>yrange</code> vale <code>false</code>, el rango de la coordenada <var>y</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>y</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>yrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [-2,3],
             explicit(x^2,x,-1,1),
             xrange = [-3,3])$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>xrange</code> y <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zrange</b>
<a name="IDX1695"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>zrange</code> vale <code>false</code>, el rango de la coordenada <var>z</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>z</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>zrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(yrange = [-3,3],
             zrange = [-2,5],
             explicit(x^2+y^2,x,-1,1,y,-1,1),
             xrange = [-3,3])$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>yrange</code> y <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logx</b>
<a name="IDX1696"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logx</code> vale <code>true</code>, el eje <var>x</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(log(x),x,0.01,5),
             logx = true)$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>logy</code> y <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logy</b>
<a name="IDX1697"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logy</code> vale <code>true</code>, el eje <var>y</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(logy = true,
             explicit(exp(x),x,0,5))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>logx</code> y <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logz</b>
<a name="IDX1698"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logz</code> vale <code>true</code>, el eje <var>z</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(logz = true,
             explicit(exp(u^2+v^2),u,-2,2,v,-2,2))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>logx</code> y <code>logy</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>terminal</b>
<a name="IDX1699"></a>
</dt>
<dd><p>Valor por defecto: <code>screen</code>
</p>
<p>Selecciona el terminal a utilizar por Gnuplot; valores posibles son:
<code>screen</code> (por defecto), <code>png</code>, <code>jpg</code>, <code>eps</code> y <code>eps_color</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Examples:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* screen terminal (default) */
      draw2d(explicit(x^2,x,-1,1))$
(%i3) /* png file */
      draw2d(terminal  = 'png,
             pic_width = 300,
             explicit(x^2,x,-1,1))$
(%i4) /* jpg file */
      draw2d(terminal   = 'jpg,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
(%i5) /* eps file */
      draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'eps)$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>file_name</code>, <code>pic_width</code> y <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>grid</b>
<a name="IDX1700"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>grid</code> vale <code>true</code>, se dibujar&aacute; una rejilla sobre el
plano <var>xy</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(grid = true,
             explicit(exp(u),u,-2,2))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>title</b>
<a name="IDX1701"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>title</code> almacena una cadena de Maxima con el 
t&iacute;tulo de la escena. Por defecto, no se escribe
t&iacute;tulo alguno.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(u),u,-2,2),
             title = &quot;Exponential function&quot;)$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xlabel</b>
<a name="IDX1702"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>xlabel</code> almacena una cadena de Maxima con la
etiqueta del eje <var>x</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             explicit(exp(u),u,-2,2),
             ylabel = &quot;Population&quot;)$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>ylabel</code> y <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ylabel</b>
<a name="IDX1703"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>ylabel</code> almacena una cadena de Maxima con la
etiqueta del eje <var>y</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             ylabel = &quot;Population&quot;,
             explicit(exp(u),u,-2,2) )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>xlabel</code> y <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zlabel</b>
<a name="IDX1704"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>zlabel</code> almacena una cadena de Maxima con la
etiqueta del eje <var>z</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(zlabel = &quot;Z variable&quot;,
             ylabel = &quot;Y variable&quot;,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2),
             xlabel = &quot;X variable&quot; )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>xlabel</code> y <code>ylabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xtics</b>
<a name="IDX1705"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>xtics</code> vale <code>true</code>, se dibujar&aacute;n las marcas 
del eje <var>x</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* No tics in the x-axis */
      draw2d(xtics = false,
             explicit(exp(u),u,-2,2))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>ytics</code> y <code>ztics</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ytics</b>
<a name="IDX1706"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>ytics</code> vale <code>true</code>, se dibujar&aacute;n las marcas 
del eje <var>y</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(ytics = false,
             explicit(exp(u),u,-2,2),
             xtics = false)$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>xtics</code> y <code>ztics</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ztics</b>
<a name="IDX1707"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>ztics</code> vale <code>true</code>, se dibujar&aacute;n las marcas 
del eje <var>z</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* No tics in the z-axis */
      draw3d(ztics = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>xtics</code> y <code>ytics</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>rot_vertical</b>
<a name="IDX1708"></a>
</dt>
<dd><p>Valor por defecto: 60
</p>
<p><code>rot_vertical</code> es el &aacute;ngulo (en grados) de la rotaci&oacute;n vertical
(alrededor del eje <var>x</var>) para situar el punto del observador en las
escenas 3d.
</p>
<p>El &aacute;ngulo debe pertenecer al intervalo <em>[0, 180]</em>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>rot_horizontal</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>rot_horizontal</b>
<a name="IDX1709"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>rot_horizontal</code> es el &aacute;ngulo (en grados) de la rotaci&oacute;n horizontal
(alrededor del eje <var>z</var>) para situar el punto del observador en las
escenas 3d.
</p>
<p>El &aacute;ngulo debe pertenecer al intervalo <em>[0, 360]</em>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             rot_horizontal = 360,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>rot_vertical</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xy_file</b>
<a name="IDX1710"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p><code>xy_file</code> es el nombre del fichero donde se almacenar&aacute;n las
coordenadas despu&eacute;s de hacer clic con el bot&oacute;n del rat&oacute;n en un
punto de la imagen y pulsado la tecla 'x'. Por defecto, las 
coordenadas no se almacenan.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>user_preamble</b>
<a name="IDX1711"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>Usuarios expertos en Gnuplot pueden hacer uso de esta opci&oacute;n para
afinar el comportamiento de Gnuplot escribiendo c&oacute;digo que ser&aacute;
enviado justo antes de la instrucci&oacute;n <code>plot</code> o <code>splot</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<p>El terminal <i>dumb</i> no est&aacute; soportado por el paquete <code>draw</code>,
pero es posible activarlo haciendo uso de la opci&oacute;n <code>user_preamble</code>,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x)-1,x,-1,1),
             parametric(cos(u),sin(u),u,0,2*%pi),
             user_preamble=&quot;set terminal dumb&quot;)$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>file_name</b>
<a name="IDX1712"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;maxima_out&quot;</code>
</p>
<p><code>file_name</code> es el nombre del fichero en el que los terminales <code>png</code>, 
<code>jpg</code>, <code>eps</code> y <code>eps_color</code> guardar&aacute;n el gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'png)$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>pic_width</code> y <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pic_width</b>
<a name="IDX1713"></a>
</dt>
<dd><p>Valor por defecto: 640
</p>
<p><code>pic_width</code> es la anchura del fichero de imagen de bits generado por
los terminales <code>png</code> y <code>jpg</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pic_height</b>
<a name="IDX1714"></a>
</dt>
<dd><p>Valor por defecto: 640
</p>
<p><code>pic_height</code> es la altura del fichero de imagen de bits generado por
los terminales <code>png</code> y <code>jpg</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pic_width</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>eps_width</b>
<a name="IDX1715"></a>
</dt>
<dd><p>Valor por defecto: 12
</p>
<p><code>eps_width</code> es el ancho (medido en cm) del archivo Postscipt
generado por los terminales <code>eps</code> y <code>eps_color</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>eps_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>eps_height</b>
<a name="IDX1716"></a>
</dt>
<dd><p>Valor por defecto: 8
</p>
<p><code>eps_height</code> es la altura (medida en cm) del archivo Postscipt
generado por los terminales <code>eps</code> y <code>eps_color</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>eps_width</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_bottom</b>
<a name="IDX1717"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_bottom</code> vale <code>true</code>, el eje inferior permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_bottom = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>axis_left</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_left</b>
<a name="IDX1718"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_left</code> vale <code>true</code>, el eje izquierdo permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_left = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_top</b>
<a name="IDX1719"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_top</code> vale <code>true</code>, el eje superior permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_top = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_right</b>
<a name="IDX1720"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_right</code> vale <code>true</code>, el eje derecho permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_right = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_3d</b>
<a name="IDX1721"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_3d</code> vale <code>true</code>, los ejes <var>x</var>, <var>y</var> y <var>z</var>
permanecen visibles en las escenas 3d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(axis_3d = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_right</code> for axis in 2d.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>palette</b>
<a name="IDX1722"></a>
</dt>
<dd><p>Valor por defecto: <code>color</code>
</p>
<p><code>palette</code> indica c&oacute;mo transformar los valores reales de una
matriz pasada al objeto <code>image</code> en componentes crom&aacute;ticas.
</p>
<p><code>palette</code> es un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
&iacute;ndice para seleccionar una f&oacute;rmula que transforma los niveles
num&eacute;ricos en las componentes crom&aacute;ticas rojo, verde y azul:
</p><table><tr><td>&nbsp;</td><td><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></td></tr></table><p>los n&uacute;meros negativos se interpretan como colores invertidos
de las componentes crom&aacute;ticas.
</p>
<p><code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>colorbox</code>.
</p></dd></dl>




<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>colorbox</b>
<a name="IDX1723"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>colorbox</code> vale <code>true</code>, se dibuja una escala de color al
lado de los objetos <code>image</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply('matrix,
                 makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
(%i4) draw2d(colorbox=false, image(im,0,0,30,30))$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>palette</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>enhanced3d</b>
<a name="IDX1724"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>enhanced3d</code> vale <code>true</code>, se coloreaer&aacute;n las superficies
de los gr&aacute;ficos tridimensionales; en otras palabras, se activa el
modo pm3d de Gnuplot.
</p>
<p>V&eacute;ase la opci&oacute;n <code>palette</code> para informarse sobre c&oacute;mo
se especifican las paletas de colores.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(surface_hide = true,
             enhanced3d   = true,
             palette      = gray,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>point_size</b>
<a name="IDX1725"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_size</code> establece el tama&ntilde;o de los puntos dibujados. Debe
ser un n&uacute;mero no negativo.
</p>

<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(points(makelist([random(20),random(50)],k,1,10)),
             point_size = 5,
             points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>point_type</b>
<a name="IDX1726"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_type</code> es un &iacute;ndice (mayor o igual que -1)
que permite especificar c&oacute;mo ser&aacute;n dibujados los puntos aislados.
El color de los puntos se controla mediante esta opci&oacute;n.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [0,10],
             yrange = [0,10],
             point_size = 3,
             point_type = 1,
             points([[1,1],[5,1],[9,1]]),
             point_type = 2,
             points([[1,2],[5,2],[9,2]]),
             point_type = 3,
             points([[1,3],[5,3],[9,3]]),
             point_type = 4,
             points([[1,4],[5,4],[9,4]]),
             point_type = 5,
             points([[1,5],[5,5],[9,5]]),
             point_type = 6,
             points([[1,6],[5,6],[9,6]]),
             point_type = 7,
             points([[1,7],[5,7],[9,7]]),
             point_type = 8,
             points([[1,8],[5,8],[9,8]]),
             point_type = 9,
             points([[1,9],[5,9],[9,9]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>points_joined</b>
<a name="IDX1727"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>points_joined</code> vale <code>true</code>, los puntos se unen con segmentos.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange        = [0,10],
             yrange        = [0,4],
             point_size    = 3,
             point_type    = 1,
             line_type     = 3,
             points([[1,1],[5,1],[9,1]]),
             points_joined = true,
             point_type    = 3,
             line_type     = 5,
             points([[1,2],[5,2],[9,2]]),
             point_type    = 5,
             line_type     = 8,
             line_width    = 7,
             points([[1,3],[5,3],[9,3]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>filled_func</b>
<a name="IDX1728"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p><code>filled_func</code> indica si la funci&oacute;n se debe rellenar (<code>true</code>)
o no (<code>false</code>).
</p>
<p>Esta opci&oacute;n s&oacute;lo afecta al objeto gr&aacute;fico bidimensional <code>explicit</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             filled_func = true,
             explicit(sin(x),x,0,10) )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>fill_color</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>transparent</b>
<a name="IDX1729"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>transparent</code> vale <code>true</code>, las regiones internas de 
los pol&iacute;gonos se rellenan de acuerdo con <code>fill_color</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(polygon([[3,2],[7,2],[5,5]]),
             transparent = true,
             color       = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>border</b>
<a name="IDX1730"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>border</code> vale <code>true</code>, los bordes de los
pol&iacute;gonos se dibujan de acuerdo con <code>line_type</code> y
<code>line_width</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(color       = brown,
             line_width  = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_both</b>
<a name="IDX1731"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>head_both</code> vale <code>true</code>, los vectores se dibujan bidireccionales.
Si vale <code>false</code>, se dibujan unidireccionales.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,8],
             yrange      = [0,8],
             head_length = 0.7,
             vector([1,1],[6,0]),
             head_both   = true,
             vector([1,7],[6,0]) )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>head_length</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_length</b>
<a name="IDX1732"></a>
</dt>
<dd><p>Valor por defecto: 2
</p>
<p><code>head_length</code> indica, en las unidades del eje <var>x</var>, la
longitud de las flechas de los vectores.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,8],
             vector([0,1],[5,5]),
             head_length = 1,
             vector([2,1],[5,5]),
             head_length = 0.5,
             vector([4,1],[5,5]),
             head_length = 0.25,
             vector([6,1],[5,5]))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_angle</b>
<a name="IDX1733"></a>
</dt>
<dd><p>Valor por defecto: 45
</p>
<p><code>head_angle</code> indica el &aacute;ngulo, en grados, entre la flecha y el
segmento del vector.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,10],
             yrange      = [0,9],
             head_length = 0.7,
             head_angle  = 10,
             vector([1,1],[0,6]),
             head_angle  = 20,
             vector([2,1],[0,6]),
             head_angle  = 30,
             vector([3,1],[0,6]),
             head_angle  = 40,
             vector([4,1],[0,6]),
             head_angle  = 60,
             vector([5,1],[0,6]),
             head_angle  = 90,
             vector([6,1],[0,6]),
             head_angle  = 120,
             vector([7,1],[0,6]),
             head_angle  = 160,
             vector([8,1],[0,6]),
             head_angle  = 180,
             vector([9,1],[0,6]) )$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_length</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_type</b>
<a name="IDX1734"></a>
</dt>
<dd><p>Valor por defecto: <code>filled</code>
</p>
<p><code>head_type</code> se utiliza para especificar c&oacute;mo se habr&aacute;n de
dibujar las flechas de los vectores. Los valores posibles para
esta opci&oacute;n son: <code>filled</code> (flechas cerradas y rellenas),
<code>empty</code> (flechas cerradas pero no rellenas) y <code>nofilled</code>
(flechas abiertas).
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_type = 'nofilled,
             vector([6,1],[5,5]))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_angle</code> y <code>head_length</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>label_alignment</b>
<a name="IDX1735"></a>
</dt>
<dd><p>Valor por defecto: <code>center</code>
</p>
<p><code>label_alignment</code> se utiliza para especificar d&oacute;nde se escribir&aacute;n
las etiquetas con respecto a las coordenadas de referencia. Los valores posibles para
esta opci&oacute;n son: <code>center</code>, <code>left</code> y <code>right</code>.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange          = [0,10],
             yrange          = [0,10],
             points_joined   = true,
             points([[5,0],[5,10]]),
             color           = blue,
             label(&quot;Centered alignment (default)&quot;,5,2),
             label_alignment = 'left,
             label(&quot;Left alignment&quot;,5,5),
             label_alignment = 'right,
             label(&quot;Right alignment&quot;,5,8))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>label_orientation</code> y <code>color</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>label_orientation</b>
<a name="IDX1736"></a>
</dt>
<dd><p>Valor por defecto: <code>horizontal</code>
</p>
<p><code>label_orientation</code> se utiliza para especificar la orientaci&oacute;n
de las etiquetas. Los valores posibles para esta opci&oacute;n son:
<code>horizontal</code> y <code>vertical</code>.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<p>En este ejemplo, el punto ficticio que se a&ntilde;ade sirve para obtener
la imagen, ya que el paquete <code>draw</code> necesita siempre de datos para
construir la escena.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange     = [0,10],
             yrange     = [0,10],
             point_size = 0,
             points([[5,5]]),
             color      = navy,
             label(&quot;Horizontal orientation (default)&quot;,5,2),
             label_orientation = 'vertical,
             color             = &quot;#654321&quot;,
             label(&quot;Vertical orientation&quot;,1,5))$
</pre></td></tr></table>
<p>V&eacute;anse tambi&eacute;n <code>label_alignment</code> y <code>color</code>. 
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>color</b>
<a name="IDX1737"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>color</code> especifica el color para dibujar l&iacute;neas,
puntos, bordes de pol&iacute;gonos y etiquetas.
</p>
<p>Los colores se pueden dar a partir de sus nombres o en
c&oacute;digo hexadecimal <i>rgb</i>.
</p>
<p>Los nombres de colores disponibles son: 
<code>&quot;white&quot;</code>, <code>&quot;black&quot;</code>, <code>&quot;gray0&quot;</code>, <code>&quot;grey0&quot;</code>, <code>&quot;gray10&quot;</code>,
<code>&quot;grey10&quot;</code>, <code>&quot;gray20&quot;</code>, <code>&quot;grey20&quot;</code>, <code>&quot;gray30&quot;</code>, <code>&quot;grey30&quot;</code>,
<code>&quot;gray40&quot;</code>, <code>&quot;grey40&quot;</code>, <code>&quot;gray50&quot;</code>, <code>&quot;grey50&quot;</code>, <code>&quot;gray60&quot;</code>,
<code>&quot;grey60&quot;</code>, <code>&quot;gray70&quot;</code>, <code>&quot;grey70&quot;</code>, <code>&quot;gray80&quot;</code>, <code>&quot;grey80&quot;</code>,
<code>&quot;gray90&quot;</code>, <code>&quot;grey90&quot;</code>, <code>&quot;gray100&quot;</code>, <code>&quot;grey100&quot;</code>, <code>&quot;gray&quot;</code>,
<code>&quot;grey&quot;</code>, <code>&quot;light-gray&quot;</code>, <code>&quot;light-grey&quot;</code>, <code>&quot;dark-gray&quot;</code>,
<code>&quot;dark-grey&quot;</code>, <code>&quot;red&quot;</code>, <code>&quot;light-red&quot;</code>, <code>&quot;dark-red&quot;</code>, <code>&quot;yellow&quot;</code>,
<code>&quot;light-yellow&quot;</code>, <code>&quot;dark-yellow&quot;</code>, <code>&quot;green&quot;</code>, <code>&quot;light-green&quot;</code>,
<code>&quot;dark-green&quot;</code>, <code>&quot;spring-green&quot;</code>, <code>&quot;forest-green&quot;</code>, <code>&quot;sea-green&quot;</code>,
<code>&quot;blue&quot;</code>, <code>&quot;light-blue&quot;</code>, <code>&quot;dark-blue&quot;</code>, <code>&quot;midnight-blue&quot;</code>, 
<code>&quot;navy&quot;</code>, <code>&quot;medium-blue&quot;</code>, <code>&quot;royalblue&quot;</code>, <code>&quot;skyblue&quot;</code>, 
<code>&quot;cyan&quot;</code>, <code>&quot;light-cyan&quot;</code>, <code>&quot;dark-cyan&quot;</code>, <code>&quot;magenta&quot;</code>, 
<code>&quot;light-magenta&quot;</code>, <code>&quot;dark-magenta&quot;</code>, <code>&quot;turquoise&quot;</code>, 
<code>&quot;light-turquoise&quot;</code>, <code>&quot;dark-turquoise&quot;</code>, <code>&quot;pink&quot;</code>, <code>&quot;light-pink&quot;</code>,
<code>&quot;dark-pink&quot;</code>, <code>&quot;coral&quot;</code>, <code>&quot;light-coral&quot;</code>, <code>&quot;orange-red&quot;</code>,
<code>&quot;salmon&quot;</code>, <code>&quot;light-salmon&quot;</code>, <code>&quot;dark-salmon&quot;</code>, <code>&quot;aquamarine&quot;</code>,
<code>&quot;khaki&quot;</code>, <code>&quot;dark-khaki&quot;</code>, <code>&quot;goldenrod&quot;</code>, <code>&quot;light-goldenrod&quot;</code>,
<code>&quot;dark-goldenrod&quot;</code>, <code>&quot;gold&quot;</code>, <code>&quot;beige&quot;</code>, <code>&quot;brown&quot;</code>, <code>&quot;orange&quot;</code>,
<code>&quot;dark-orange&quot;</code>, <code>&quot;violet&quot;</code>, <code>&quot;dark-violet&quot;</code>, <code>&quot;plum&quot;</code> y <code>&quot;purple&quot;</code>.
</p>
<p>Las componentes crom&aacute;ticas en c&oacute;digo hexadecimal se introducen 
en el formato <code>&quot;#rrggbb&quot;</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default is black */
             color = &quot;red&quot;,
             explicit(0.5 + x^2,x,-1,1),
             color = blue,
             explicit(1 + x^2,x,-1,1),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             explicit(1.5 + x^2,x,-1,1),
             color = &quot;#23ab0f&quot;,
             label(&quot;This is a label&quot;,0,1.2)  )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>fill_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>fill_color</b>
<a name="IDX1738"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;red&quot;</code>
</p>
<p><code>fill_color</code> especifica el color para rellenar pol&iacute;gonos
y funciones expl&iacute;citas bidimensionales.
</p>
<p>V&eacute;ase <code>color</code> para m&aacute;s informaci&oacute;n sobre c&oacute;mo definir 
colores.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>line_width</b>
<a name="IDX1739"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>line_width</code> es el ancho de las l&iacute;neas a dibujar.
Su valor debe ser un n&uacute;mero positivo.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code> y <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default width */
             line_width = 5.5,
             explicit(1 + x^2,x,-1,1),
             line_width = 10,
             explicit(2 + x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>line_type</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>line_type</b>
<a name="IDX1740"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>line_type</code> indica c&oacute;mo se van a dibujar las l&iacute;neas;
valores posibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_type = dots,
             explicit(1 + x^2,x,-1,1),
             line_type = solid, /* default */
             explicit(2 + x^2,x,-1,1))$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>line_width</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>nticks</b>
<a name="IDX1741"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>nticks</code> es el n&uacute;mero de puntos muestreados por la rutina gr&aacute;fica.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>ellipse</code>, <code>explicit</code>, <code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = true,
             ellipse(0,0,4,2,0,180),
             nticks = 5,
             ellipse(0,0,4,2,180,180) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>adapt_depth</b>
<a name="IDX1742"></a>
</dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>adapt_depth</code> es el n&uacute;mero m&aacute;ximo de particiones utilizadas por
la rutina gr&aacute;fica adaptativa.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>explicit</code> en 2d.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>key</b>
<a name="IDX1743"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p><code>key</code> es la clave de una funci&oacute;n en la leyenda. Si <code>key</code>
es una cadena vac&iacute;a, las funciones no tendr&aacute;n clave
asociada en la leyenda.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>,
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code>,
y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(key = &quot;Sinus&quot;,
             explicit(sin(x),x,0,10),
             key = &quot;Cosinus&quot;,
             line_type = 3,
             explicit(cos(x),x,0,10) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xu_grid</b>
<a name="IDX1744"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>xu_grid</code> es el n&uacute;mero de coordenadas de la primera variable
(<code>x</code> en superficies explc&iacute;tas y <code>u</code> en las
param&eacute;tricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>yv_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yv_grid</b>
<a name="IDX1745"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>yv_grid</code> es el n&uacute;mero de coordenadas de la segunda variable
(<code>y</code> en superficies explc&iacute;tas y <code>v</code> en las
param&eacute;tricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>xu_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>surface_hide</b>
<a name="IDX1746"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>surface_hide</code> vale <code>true</code>, las partes ocultas no
se muestran en las superficies de las escenas 3d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw(columns=2,
           gr3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)),
           gr3d(surface_hide = true,
                explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>contour</b>
<a name="IDX1747"></a>
</dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>La opci&oacute;n <code>contour</code> permite al usuario decidir d&oacute;nde colocar
las l&iacute;neas de nivel.
Valores posibles son:
</p>
<ul>
<li>
<code>none</code>:
no se dibujan l&iacute;neas de nivel.

</li><li>
<code>base</code>:
las l&iacute;neas de nivel se proyectan sobre el plano xy.

</li><li>
<code>surface</code>:
las l&iacute;neas de nivel se dibujan sobre la propia superficie.

</li><li>
<code>both</code>:
se dibujan dos conjuntos de l&iacute;neas de nivel: sobre
la superficie y las que se proyectan sobre el plano xy.

</li><li>
<code>map</code>:
las l&iacute;neas de nivel se proyectan sobre el plano xy
y el punto de vista del observador se coloca perpendicularmente a &eacute;l.

</li></ul>

<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>contour_levels</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>contour_levels</b>
<a name="IDX1748"></a>
</dt>
<dd><p>Valor por defecto: 5
</p>
<p><code>contour_levels</code> is the number of levels in contour plots.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>contour</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>columns</b>
<a name="IDX1749"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>columns</code> es el n&uacute;mero de columnas en gr&aacute;ficos m&uacute;ltiples.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></td></tr></table>
</dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ip_grid</b>
<a name="IDX1750"></a>
</dt>
<dd><p>Valor por defecto: <code>[50, 50]</code>
</p>
<p><code>ip_grid</code> establece la rejilla del primer muestreo para los
gr&aacute;ficos de funciones impl&iacute;citas.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ip_grid_in</b>
<a name="IDX1751"></a>
</dt>
<dd><p>Valor por defecto: <code>[5, 5]</code>
</p>
<p><code>ip_grid_in</code> establece la rejilla del segundo muestreo para los
gr&aacute;ficos de funciones impl&iacute;citas.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>






<dl>
<dt><u>Constructor de escena:</u> <b>gr2d</b><i> (<var>Opci&oacute;n gr&aacute;fica</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1752"></a>
</dt>
<dd><p>La funci&oacute;n <code>gr2d</code> construye un objeto que describe una escena 2d. Los
argumentos son <i>opciones gr&aacute;ficas</i> y <i>objetos gr&aacute;ficos</i>. Esta escena
se interpreta secuencialmente: las <i>opciones gr&aacute;ficas</i> afectan a aquellos
<i>objetos gr&aacute;ficos</i> colocados a su derecha.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>Esta es la lista de <i>objetos gr&aacute;ficos</i> disponibles para escenas en dos
dimensiones:
</p>
<ul>
<li>
<code>points([[x1,y1], [x2,y2], [x3,y3],...])</code> o <code>points([x1,x2,x3,...], [y1,y2,y3,...])</code>:
dibuja los puntos <code>[x1,y1]</code>, <code>[x2,y2]</code>, <code>[x2,y2]</code>, ....

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(key           = &quot;puntitos&quot;,
             points(makelist([random(20),random(50)],k,1,10)),
             point_type    = 6,
             point_size    = 3,
             points_joined = true,
             key           = &quot;puntazos&quot;,
             points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></td></tr></table>


</li><li>
<code>polygon([[x1,y1], [x2,y2], [x3,y3],...])</code> o <code>polygon([x1,x2,x3,...], [y1,y2,y3,...])</code>:
dibuja sobre el plano el pol&iacute;gono de v&eacute;rtices <code>[x1,y1]</code>, <code>[x2,y2]</code>,
<code>[x2,y2]</code>, ....

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
 <code>line_type</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(color      = &quot;#e245f0&quot;,
             line_width = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = yellow,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table>

</li><li>
<code>rectangle([x1,y1], [x2,y2])</code>:
dibuja un rect&aacute;ngulo con v&eacute;rtices opuestos <code>[x1,y1]</code> y <code>[x2,y2]</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             line_width  = 6,
             line_type   = dots,
             transparent = false,
             fill_color  = blue,
             rectangle([-2,-2],[8,-1]),   /* opposite vertices */
             transparent = true,
             line_type   = solid,
             line_width  = 1,
             rectangle([9,4],[2,-1.5]),
             xrange      = [-3,10],
             yrange      = [-3,4.5] )$
</pre></td></tr></table>

</li><li>
<code>ellipse(xc, yc, a, b, ang1, ang2)</code>:
dibuja una elipse de centro <code>[xc, yc]</code> con semiejes horizontal y vertical
<code>a</code> y <code>b</code>, respectivamente, a partir del &aacute;ngulo <code>ang1</code> un
&aacute;ngulo de amplitud <code>ang2</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>transparent</code>, <code>fill_color</code>, <code>border</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = false,
             fill_color  = red,
             color       = gray30,
             transparent = false,
             line_width  = 5,
             ellipse(0,6,3,2,270,-270),  /* center (x,y), a, b, start &amp; end in degrees */
             transparent = true,
             color       = blue,
             line_width  = 3,
             ellipse(2.5,6,2,3,30,-90),
             xrange      = [-3,6],
             yrange      = [2,9] )$
</pre></td></tr></table>

</li><li>
<code>label(string,x,y)</code>:
escribe el texto <code>string</code> en la posici&oacute;n <code>[x,y]</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>label_alignment</code>, 
<code>label_orientation</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<p>En este ejemplo, el punto ficticio que se a&ntilde;ade sirve para obtener
la imagen, ya que el paquete <code>draw</code> necesita siempre de datos para
construir la escena. Estos colores pueden cambiar en diferentes terminales.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1),
             color = &quot;red&quot;,
             label(&quot;Label in red&quot;,0,0.3),
             color = &quot;#0000ff&quot;,
             label(&quot;Label in blue&quot;,0,0.6),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             label(&quot;Label in light-blue&quot;,0,0.9)  )$
</pre></td></tr></table>


</li><li>
<code>vector([x,y], [dx,dy])</code>:
dibuja el vector <code>[dx,dy]</code> con origen en <code>[x,y]</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>head_both</code>, 
<code>head_length</code>, <code>head_angle</code>, <code>head_type</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_both = true,
             head_type = 'nofilled,
             line_type = dots,
             vector([6,1],[5,5]))$
</pre></td></tr></table>


</li><li>
<code>explicit(fcn,var,minval,maxval)</code>:
dibuja la funci&oacute;n expl&iacute;cita <code>fcn</code>, con la variable <code>var</code> 
tomando valores desde <code>minval</code> hasta <code>maxval</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>adapt_depth</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>filled_func</code>, <code>fill_color</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_width = 3,
             color      = blue,
             explicit(x^2,x,-3,3) )$
(%i3) draw2d(fill_color  = brown,
             filled_func = true,
             explicit(x^2,x,-3,3) )$
</pre></td></tr></table>


</li><li>
<code>implicit(fcn,x-var,x-minval,x-maxval,y-var,y-minval,y-maxval)</code>:
dibuja la funci&oacute;n impl&iacute;cita <code>fcn</code>, con la variable <code>x-var</code> 
tomando valores desde <code>x-minval</code> hasta <code>x-maxval</code> y la variable <code>y-var</code>
tomando valores desde <code>y-minval</code> hasta <code>y-maxval</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>ip_grid</code>, 
<code>ip_grid_in</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal  = eps,
             grid      = true,
             line_type = solid,
             key       = &quot;y^2=x^3-2*x+1&quot;,
               implicit(y^2=x^3-2*x+1, x, -4,4, y, -4,4),
             line_type = dots,
             key       = &quot;x^3+y^3 = 3*x*y^2-x-1&quot;,
              implicit(x^3+y^3 = 3*x*y^2-x-1, x, -4,4, y, -4,4),
             title     = &quot;Two implicit functions&quot; )$
</pre></td></tr></table>

</li><li>
<code>polar(radius,ang,minang,maxang)</code>:
dibuja la funci&oacute;n <code>radius(ang)</code> definida en coordenadas polares, con la variable <code>ang</code>
tomando valores desde <code>minang</code> hasta <code>maxang</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(user_preamble = &quot;set grid polar&quot;,
             nticks        = 200,
             xrange        = [-5,5],
             yrange        = [-5,5],
             line_type     = 6,
             line_width    = 3,
             title         = &quot;Hyperbolic Spiral&quot;,
             polar(10/theta,theta,1,10*%pi) )$
</pre></td></tr></table>


</li><li>
<code>parametric(xfun,yfun,par,parmin,parmax)</code>:
dibuja la funci&oacute;n param&eacute;trica <code>[xfun,yfun]</code>, con el par&aacute;metro <code>par</code>
tomando valores desde <code>parmin</code> hasta <code>parmax</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code>and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x),x,-1,3),
             color = red,
             key   = &quot;This is the parametric one!!&quot;,
             parametric(2*cos(rrr),rrr^2,rrr,0,2*%pi))$
</pre></td></tr></table>


</li><li>
<code>image(im,x0,y0,width,height)</code>:
dibuja la imagen <code>im</code> en la regi&oacute;n rectangular desde el v&eacute;rtice <code>(x0,y0)</code>
hasta el <code>(x0+width,y0+height)</code> del plano real. El argumento <code>im</code> debe ser una
matriz de n&uacute;meros reales o una matriz de vectores de longitud tres.

<p>Si <code>im</code> es una matriz de n&uacute;meros reales, los valores de los
p&iacute;xeles se interpretan seg&uacute;n indique la opci&oacute;n
gr&aacute;fica <code>palette</code>, que es un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
&iacute;ndice para seleccionar una f&oacute;rmula que transforma los niveles
num&eacute;ricos en las componentes crom&aacute;ticas rojo, verde y azul:
</p><table><tr><td>&nbsp;</td><td><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></td></tr></table><p>los n&uacute;meros negativos se interpretan como colores invertidos
de las componentes crom&aacute;ticas.
</p>
<p><code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>Si <code>im</code> es una matriz de vectores de longitud tres, s'tos se
interpretar&aacute;n como las componentes crom&aacute;ticas rojo, verde y azul.
</p>
<p>Ejemplos:
</p>
<p>Si <code>im</code> es una matriz de n&uacute;meros reales, los valores de los
p&iacute;xeles se interpretan seg&uacute;n indique la opci&oacute;n
gr&aacute;fica <code>palette</code>.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></td></tr></table>
<p>V&eacute;ase tambi&eacute;n <code>colorbox</code>.
</p>
<p>Si <code>im</code> es una matriz de vectores de longitud tres, &eacute;stos se
interpretar&aacute;n como las componentes crom&aacute;ticas rojo, verde y azul.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
            'matrix,
             makelist(
               makelist([random(300),
                         random(300),
                         random(300)],i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
</pre></td></tr></table>


</li></ul>

<p>V&eacute;anse tambi&eacute;n las siguientes opciones gr&aacute;ficas: <code>xrange</code>, <code>yrange</code>, 
<code>logx</code>, <code>logy</code>, <code>terminal</code>, <code>grid</code>, <code>title</code>, 
<code>xlabel</code>, <code>ylabel</code>, <code>xtics</code>, <code>ytics</code>, <code>xy_file</code>, 
<code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, <code>axis_top</code> 
y <code>axis_right</code>.
</p>
</dd></dl>




<dl>
<dt><u>Constructor de escena:</u> <b>gr3d</b><i> (<var>Opci&oacute;n gr&aacute;fica</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1753"></a>
</dt>
<dd><p>La funci&oacute;n <code>gr3d</code> construye un objeto que describe una escena 3d. Los
argumentos son <i>opciones gr&aacute;ficas</i> y <i>objetos gr&aacute;ficos</i>. Esta escena
se interpreta secuencialmente: las <i>opciones gr&aacute;ficas</i> afectan a aquellos
<i>objetos gr&aacute;ficos</i> colocados a su derecha.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>Esta es la lista de <i>objetos gr&aacute;ficos</i> disponibles para escenas en tres
dimensiones:
</p>

<ul>
<li>
<code>points([[x1,y1,z1], [x2,y2,z2], [x3,y3,z3],...])</code> o 
<code>points([x1,x2,x3,...], [y1,y2,y3,...], [z1,z2,z3,...])</code>:
dibuja los puntos <code>[x1,y1,z1]</code>, <code>[x2,y2,z2]</code>, <code>[x2,y2,z3]</code>, ....

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>, <code>line_type</code>
and <code>color</code>.
</p>
<p>Ejemplos:
</p>
<p>Una muestra tridimensional,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title      = &quot;Daily average wind speeds&quot;,
             point_size = 2,
             points(args(submatrix (s2, 4, 5))) )$
</pre></td></tr></table>
<p>Dos muestras tridimensionales,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title      = &quot;Daily average wind speeds. Two data sets&quot;,
             point_size = 2,
             key        = &quot;Sample from stations 1, 2 and 3&quot;,
             points(args(submatrix (s2, 4, 5))),
             point_type = 4,
             key        = &quot;Sample from stations 1, 4 and 5&quot;,
             points(args(submatrix (s2, 2, 3))) )$
</pre></td></tr></table>

</li><li>
<code>label(string,x,y,z)</code>:
escribe el texto <code>string</code> en la posici&oacute;n <code>[x,y,z]</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>label_alignment</code>, 
<code>label_orientation</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = red,
             label(&quot;UP&quot;,-2,0,3),
             color = blue,
             label(&quot;DOWN&quot;,2,0,-3) )$
</pre></td></tr></table>

</li><li>
<code>explicit(fcn,var1,minval1,maxval1,var2,minval2,maxval2)</code>:
dibuja la funci&oacute;n expl&iacute;cita <code>fcn</code>, con la variable <code>var1</code>
tomando valores desde <code>minval1</code> hasta <code>maxval1</code> y la variable <code>var2</code>
tomando valores desde <code>minval2</code> hasta <code>maxval2</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(key   = &quot;Gauss&quot;,
             color = &quot;#a02c00&quot;,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
             yv_grid = 10,
             color   = blue,
             key     = &quot;Plane&quot;,
             explicit(x+y,x,-5,5,y,-5,5),
             surface_hide = true)$
</pre></td></tr></table>

</li><li>
<code>parametric(xfun,yfun,zfun,par,parmin,parmax)</code>:
dibuja la funci&oacute;n param&eacute;trica <code>[xfun,yfun,zfun]</code>, con el par&aacute;metro <code>par</code>
tomando valores desde <code>parmin</code> hasta <code>parmax</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = royalblue,
             parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2),
             color      = turquoise,
             line_width = 2,
             parametric(t^2,sin(t),2+t,t,0,2),
             surface_hide = true,
             title = &quot;Surface &amp; curves&quot; )$
</pre></td></tr></table>

</li><li>
<code>parametric_surface(xfun,yfun,zfun,par1,par1min,par1max,par2,par2min,par2max)</code>:
dibuja la superficie param&eacute;trica <code>[xfun,yfun,zfun]</code>, con el par&aacute;metro <code>par1</code>
tomando valores desde <code>par1min</code> hasta <code>par1max</code> y el par&aacute;metro <code>par2</code>
tomando valores desde <code>par2min</code> hasta <code>par2max</code>.

<p>Este objeto depende de las siguientes <i>opciones gr&aacute;ficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(title          = &quot;Sea shell&quot;,
             xu_grid        = 100,
             yv_grid        = 25,
             rot_vertical   = 100,
             rot_horizontal = 20,
             surface_hide   = true,
             parametric_surface(0.5*u*cos(u)*(cos(v)+1),
                                0.5*u*sin(u)*(cos(v)+1),
                                u*sin(v) - ((u+3)/8*%pi)^2 - 20,
                                u, 0, 13*%pi, v, -%pi, %pi) )$
</pre></td></tr></table>
</li></ul>

<p>V&eacute;anse tambi&eacute;n las siguientes opciones gr&aacute;ficas: <code>xrange</code>, <code>yrange</code>, 
<code>zrange</code>, <code>logx</code>, <code>logy</code>, <code>logz</code>, <code>terminal</code>, 
<code>grid</code>, <code>title</code>, <code>xlabel</code>, <code>ylabel</code>, <code>zlabel</code>, 
<code>xtics</code>, <code>ytics</code>, <code>ztics</code>, <code>xy_file</code>, 
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, 
<code>axis_top</code>, <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>axis_right</code>, <code>rot_vertical</code>, <code>rot_horizontal</code>, 
<code>axis_3d</code>, <code>xu_grid</code>, <code>yv_grid</code>, <code>surface_hide</code>, 
<code>contour</code>, <code>contour_levels</code>, <code>palette</code>, <code>colorbox</code>
y <code>enhanced3d</code>.
</p>
</dd></dl>







<dl>
<dt><u>Funci&oacute;n:</u> <b>draw</b><i> (<var>gr2d</var>, ..., <var>gr3d</var>, ..., <var>options</var>, ...)</i>
<a name="IDX1754"></a>
</dt>
<dd><p>Representa gr&aacute;ficamente una serie de escenas; sus argumentos son objetos
<code>gr2d</code> y <code>gr3d</code>, junto con algunas opciones. Por defecto, 
las escenas se representan en una columna.
</p>
<p>La funci&oacute;n <code>draw</code> acepta dos opciones posibles:<code>terminal</code> 
y <code>columns</code>.
</p>
<p>Las funciones <code>draw2d</code> y <code>draw3d</code> son atajos a utilizar
cuando se quiere representar una &uacute;nica escena en dos o tres
dimensiones, respectivamente.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>Ejemplo:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></td></tr></table></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>draw2d</b><i> (<var>option</var>, <var>graphic object</var>, ...)</i>
<a name="IDX1755"></a>
</dt>
<dd><p>Esta funci&oacute;n es un atajo para
<code>draw2d(gr2d(<var>options</var>, ..., <var>graphic object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una &uacute;nica escena en 2d.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>draw3d</b><i> (<var>option</var>, <var>graphic object</var>, ...)</i>
<a name="IDX1756"></a>
</dt>
<dd><p>Esta funci&oacute;n es un atajo para
<code>draw3d(gr3d(<var>options</var>, ..., <var>graphic object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una &uacute;nica escena en 3d.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>draw_pipes</b>
<a name="IDX1757"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>draw_pipes</code> vale <code>true</code>, Maxima se comunica con Gnuplot
mediante una tuber&iacute;a (<i>pipe</i>, en ingl&eacute;s). Cuando <code>draw_pipes</code>
vale <code>false</code>, Maxima se comunica con Gnuplot mediante ficheros.
Esto s&oacute;lo tiene efecto en sistemas que no son Windows.
</p>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC180" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC183" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_74.html#SEC268" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>mayo, 2 2007</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
